results/ycsb/4-nodes/6-clients/couchbase2/workloadc_couchbase_custom-validation2/results-60.txt
[OVERALL], RunTime(ms), 143997
[OVERALL], Throughput(ops/sec), 694.4589123384515
[TOTAL_GCS_G1_Young_Generation], Count, 39
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1087
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7548768377118968
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 39
[TOTAL_GC_TIME], Time(ms), 1087
[TOTAL_GC_TIME_%], Time(%), 0.7548768377118968
[CLEANUP], Operations, 60
[CLEANUP], AverageLatency(us), 0.6666666666666666
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 0, 1.0
[CLEANUP], 1000, 0.6111111111111112
[CLEANUP], 2000, 0.6896551724137931
[CLEANUP], 3000, 0.5555555555555556
[UPDATE], Operations, 5000
[UPDATE], AverageLatency(us), 12004.9104
[UPDATE], MinLatency(us), 211
[UPDATE], MaxLatency(us), 3431143
[UPDATE], Return=OK, 5000
[UPDATE], 0, 420490.05263157893
[UPDATE], 1000, 27931.9
[UPDATE], 2000, 19803.75
[UPDATE], 3000, 15674.548387096775
[UPDATE], 4000, 71650.06666666667
[UPDATE], 5000, 12831.151515151516
[UPDATE], 6000, 10314.173913043478
[UPDATE], 7000, 44469.59459459459
[UPDATE], 8000, 9233.585365853658
[UPDATE], 9000, 8885.510638297872
[UPDATE], 10000, 11005.404761904761
[UPDATE], 11000, 14288.894736842105
[UPDATE], 12000, 10022.725490196079
[UPDATE], 13000, 11020.022222222222
[UPDATE], 14000, 14892.36170212766
[UPDATE], 15000, 7671.238095238095
[UPDATE], 16000, 7294.906976744186
[UPDATE], 17000, 36209.02857142857
[UPDATE], 18000, 8109.078431372549
[UPDATE], 19000, 6310.868421052632
[UPDATE], 20000, 7276.444444444444
[UPDATE], 21000, 7495.593220338983
[UPDATE], 22000, 5669.0
[UPDATE], 23000, 7736.866666666667
[UPDATE], 24000, 9776.870967741936
[UPDATE], 25000, 6110.377358490566
[UPDATE], 26000, 7730.241379310345
[UPDATE], 27000, 6770.846153846154
[UPDATE], 28000, 6512.7307692307695
[UPDATE], 29000, 7271.333333333333
[UPDATE], 30000, 6291.434782608696
[UPDATE], 31000, 9833.659574468085
[UPDATE], 32000, 11618.027777777777
[UPDATE], 33000, 4805.78125
[UPDATE], 34000, 8375.050847457627
[UPDATE], 35000, 5201.3125
[UPDATE], 36000, 7923.7959183673465
[UPDATE], 37000, 12458.148148148148
[UPDATE], 38000, 7499.156862745098
[UPDATE], 39000, 6746.69696969697
[UPDATE], 40000, 5619.387096774193
[UPDATE], 41000, 5261.233333333334
[UPDATE], 42000, 5397.066666666667
[UPDATE], 43000, 7448.266666666666
[UPDATE], 44000, 6651.744680851064
[UPDATE], 45000, 6582.875
[UPDATE], 46000, 5535.697674418605
[UPDATE], 47000, 6395.170731707317
[UPDATE], 48000, 5656.04
[UPDATE], 49000, 5249.0
[UPDATE], 50000, 6136.782608695652
[UPDATE], 51000, 4477.658536585366
[UPDATE], 52000, 8908.424242424242
[UPDATE], 53000, 6042.88
[UPDATE], 54000, 7467.866666666667
[UPDATE], 55000, 7415.833333333333
[UPDATE], 56000, 10309.75
[UPDATE], 57000, 8765.5625
[UPDATE], 58000, 7430.054054054054
[UPDATE], 59000, 5501.340425531915
[UPDATE], 60000, 5337.5142857142855
[UPDATE], 61000, 5658.072727272727
[UPDATE], 62000, 5924.851063829788
[UPDATE], 63000, 7298.933333333333
[UPDATE], 64000, 7483.142857142857
[UPDATE], 65000, 6282.055555555556
[UPDATE], 66000, 5409.409090909091
[UPDATE], 67000, 7167.533333333334
[UPDATE], 68000, 8149.958333333333
[UPDATE], 69000, 7563.142857142857
[UPDATE], 70000, 7459.489361702128
[UPDATE], 71000, 7408.928571428572
[UPDATE], 72000, 10123.516129032258
[UPDATE], 73000, 10978.285714285714
[UPDATE], 74000, 10874.0
[UPDATE], 75000, 5638.586206896552
[UPDATE], 76000, 12102.263157894737
[UPDATE], 77000, 8429.611111111111
[UPDATE], 78000, 8677.807692307691
[UPDATE], 79000, 5266.676470588235
[UPDATE], 80000, 5481.774193548387
[UPDATE], 81000, 9598.181818181818
[UPDATE], 82000, 5419.205882352941
[UPDATE], 83000, 6421.0625
[UPDATE], 84000, 34445.875
[UPDATE], 85000, 7415.194444444444
[UPDATE], 86000, 7811.941176470588
[UPDATE], 87000, 10315.76923076923
[UPDATE], 88000, 15019.71794871795
[UPDATE], 89000, 7641.0526315789475
[UPDATE], 90000, 6048.078947368421
[UPDATE], 91000, 7486.068965517241
[UPDATE], 92000, 3667.464285714286
[UPDATE], 93000, 8374.727272727272
[UPDATE], 94000, 22643.666666666668
[UPDATE], 95000, 8657.136363636364
[UPDATE], 96000, 5726.25
[UPDATE], 97000, 6376.9
[UPDATE], 98000, 5347.551724137931
[UPDATE], 99000, 7474.35
[UPDATE], 100000, 6899.814814814815
[UPDATE], 101000, 4874.739130434783
[UPDATE], 102000, 3845.6666666666665
[UPDATE], 103000, 10069.947368421053
[UPDATE], 104000, 126858.1
[UPDATE], 105000, 15027.333333333334
[UPDATE], 106000, 12484.925925925925
[UPDATE], 107000, 6297.333333333333
[UPDATE], 108000, 8350.617647058823
[UPDATE], 109000, 13997.2
[UPDATE], 110000, 8173.6578947368425
[UPDATE], 111000, 3835.3846153846152
[UPDATE], 112000, 7267.37037037037
[UPDATE], 113000, 8666.52380952381
[UPDATE], 114000, 8503.382352941177
[UPDATE], 115000, 6652.921052631579
[UPDATE], 116000, 5908.851851851852
[UPDATE], 117000, 6705.636363636364
[UPDATE], 118000, 7137.911764705882
[UPDATE], 119000, 7456.583333333333
[UPDATE], 120000, 5559.317073170731
[UPDATE], 121000, 6276.363636363636
[UPDATE], 122000, 4953.557692307692
[UPDATE], 123000, 9945.609756097561
[UPDATE], 124000, 12526.6
[UPDATE], 125000, 10964.379310344828
[UPDATE], 126000, 41902.30303030303
[UPDATE], 127000, 6687.5
[UPDATE], 128000, 13881.864864864865
[UPDATE], 129000, 30257.03448275862
[UPDATE], 130000, 9616.761904761905
[UPDATE], 131000, 8583.76923076923
[UPDATE], 132000, 5874.88
[UPDATE], 133000, 6005.375
[UPDATE], 134000, 8068.064516129032
[UPDATE], 135000, 9705.351351351352
[UPDATE], 136000, 43794.03846153846
[UPDATE], 137000, 1117.75
[SCAN], Operations, 95000
[SCAN], AverageLatency(us), 87235.14291578947
[SCAN], MinLatency(us), 1264
[SCAN], MaxLatency(us), 3962644
[SCAN], Return=OK, 95000
[SCAN], 0, 1154070.6354166667
[SCAN], 1000, 138387.35294117648
[SCAN], 2000, 137735.41379310345
[SCAN], 3000, 92393.07042253521
[SCAN], 4000, 137934.3162583519
[SCAN], 5000, 77127.55859375
[SCAN], 6000, 87598.38257016249
[SCAN], 7000, 70206.41595092024
[SCAN], 8000, 86981.10113960115
[SCAN], 9000, 83248.60644257703
[SCAN], 10000, 70598.5592028136
[SCAN], 11000, 67331.77738927738
[SCAN], 12000, 67461.5615982242
[SCAN], 13000, 76829.10769230769
[SCAN], 14000, 60223.48272357724
[SCAN], 15000, 62850.228861330324
[SCAN], 16000, 89916.92296718973
[SCAN], 17000, 91566.61586314153
[SCAN], 18000, 80406.66392318244
[SCAN], 19000, 73096.4123337364
[SCAN], 20000, 63516.17484008529
[SCAN], 21000, 68548.02957906712
[SCAN], 22000, 68807.9424626007
[SCAN], 23000, 80594.16711956522
[SCAN], 24000, 74561.96261682243
[SCAN], 25000, 74039.98161764706
[SCAN], 26000, 76013.73185731858
[SCAN], 27000, 126990.475826972
[SCAN], 28000, 147040.18776371307
[SCAN], 29000, 88001.86734693877
[SCAN], 30000, 71723.94865810969
[SCAN], 31000, 72824.95592286502
[SCAN], 32000, 95022.3735632184
[SCAN], 33000, 80565.5572755418
[SCAN], 34000, 78209.18720930233
[SCAN], 35000, 76582.58648648649
[SCAN], 36000, 81430.38815789473
[SCAN], 37000, 80558.46132971506
[SCAN], 38000, 88140.14501510574
[SCAN], 39000, 70376.83893395134
[SCAN], 40000, 89407.07098765433
[SCAN], 41000, 83852.73691654879
[SCAN], 42000, 69902.87528089888
[SCAN], 43000, 75947.54569190601
[SCAN], 44000, 86726.14307458143
[SCAN], 45000, 68405.34422657952
[SCAN], 46000, 68043.5799522673
[SCAN], 47000, 84491.5406451613
[SCAN], 48000, 63997.721436343854
[SCAN], 49000, 67451.35790725327
[SCAN], 50000, 65491.007329842934
[SCAN], 51000, 78261.0607661823
[SCAN], 52000, 75872.73042362003
[SCAN], 53000, 78993.29506008011
[SCAN], 54000, 108207.39177101968
[SCAN], 55000, 93492.57419354838
[SCAN], 56000, 107064.43595041323
[SCAN], 57000, 134139.77376425854
[SCAN], 58000, 74518.44504748982
[SCAN], 59000, 73501.62588235294
[SCAN], 60000, 78504.65178571429
[SCAN], 61000, 67687.15819861431
[SCAN], 62000, 71356.25934861279
[SCAN], 63000, 87583.48753894081
[SCAN], 64000, 131263.77824267783
[SCAN], 65000, 82442.11455525606
[SCAN], 66000, 79064.85045513655
[SCAN], 67000, 65204.47113163972
[SCAN], 68000, 115701.59375
[SCAN], 69000, 96417.2615844544
[SCAN], 70000, 65153.733934611046
[SCAN], 71000, 86492.1705882353
[SCAN], 72000, 100736.8934169279
[SCAN], 73000, 128238.12222222223
[SCAN], 74000, 150874.01446280992
[SCAN], 75000, 102786.34738617201
[SCAN], 76000, 83699.87161198288
[SCAN], 77000, 76787.28067226891
[SCAN], 78000, 116423.13050570962
[SCAN], 79000, 80995.72418300653
[SCAN], 80000, 93866.0699844479
[SCAN], 81000, 95672.39644012945
[SCAN], 82000, 85053.52899575671
[SCAN], 83000, 102277.44166666667
[SCAN], 84000, 69615.00369458128
[SCAN], 85000, 85893.53428571428
[SCAN], 86000, 119965.17113402062
[SCAN], 87000, 106004.23487544485
[SCAN], 88000, 100594.73841059602
[SCAN], 89000, 91705.7737556561
[SCAN], 90000, 70591.3045112782
[SCAN], 91000, 93265.76252019386
[SCAN], 92000, 133466.75454545455
[SCAN], 93000, 105247.36
[SCAN], 94000, 94236.4691588785
[SCAN], 95000, 131553.74900398406
[SCAN], 96000, 100896.63910969794
[SCAN], 97000, 78169.94342105264
[SCAN], 98000, 75007.13598901099
[SCAN], 99000, 110840.5514834206
[SCAN], 100000, 78621.42479108635
[SCAN], 101000, 126170.41188118812
[SCAN], 102000, 112698.23163841807
[SCAN], 103000, 100916.30051813471
[SCAN], 104000, 85332.47763578275
[SCAN], 105000, 116417.74270072993
[SCAN], 106000, 77828.83875338754
[SCAN], 107000, 83199.459602649
[SCAN], 108000, 77280.23461538462
[SCAN], 109000, 64842.320541760724
[SCAN], 110000, 74493.99499374218
[SCAN], 111000, 73872.14374225527
[SCAN], 112000, 67769.15102974829
[SCAN], 113000, 76009.9719745223
[SCAN], 114000, 85981.48755490483
[SCAN], 115000, 92035.32650073206
[SCAN], 116000, 69371.82926829268
[SCAN], 117000, 76445.9628681178
[SCAN], 118000, 92490.32252836305
[SCAN], 119000, 115803.98298676749
[SCAN], 120000, 100335.9884868421
[SCAN], 121000, 97381.29914529914
[SCAN], 122000, 80493.56735751295
[SCAN], 123000, 106725.35778175313
[SCAN], 124000, 88364.64601769911
[SCAN], 125000, 114009.7012987013
[SCAN], 126000, 91874.98826979472
[SCAN], 127000, 87152.80232558139
[SCAN], 128000, 103723.6529209622
[SCAN], 129000, 94688.68031496063
[SCAN], 130000, 86189.28985507246
[SCAN], 131000, 96846.42326332795
[SCAN], 132000, 111159.15175097276
[SCAN], 133000, 95266.13298791018
[SCAN], 134000, 79873.39572864321
[SCAN], 135000, 83422.70015698587
[SCAN], 136000, 32178.750666666667
[SCAN], 137000, 12540.560606060606